# StairsEditScope Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
StairsEditScope Methods
StairsEditScope Class See Also
---
The StairsEditScope type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Cancel | Cancels the edit scope.  (Inherited from EditScope.) |
| Commit | Finishes the edit scope.  (Inherited from EditScope.) |
| Dispose | (Inherited from EditScope.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| Start(ElementId) | Starts an stairs edit mode for an existing Stairs element |
| Start(ElementId, ElementId) | Creates a new empty stairs element with a default stairs type in the specified levels and then starts stairs edit mode and editing the new stairs. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
StairsEditScope Class
Autodesk.Revit.DB Namespace